In [46]:
import numpy as np
import pandas as pd

In [185]:
# Creating a Dictionary for dataframe
emp = {
    "EMP_ID":[101,102,103,104,105],
    "EMP_NAME":["Rahul Kumar","Vijay Sagar","Siya Singh","Ravi Kumar","Raju Dev"],
    "EMP_SAL":[35300,25500,np.nan,56000,np.nan],
    "EMP_COMPANY":["Google","Microsoft","OpenAI","Google",np.nan],
    "EMP_COUNTRY":["INDIA","JAPAN","USA","AUSTRALIA","SPAIN"]
}

In [186]:
df = abc.DataFrame(emp)

In [82]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev      NaN         NaN

In [61]:
df.isnull()

   EMP_ID  EMP_NAME  EMP_SAL  EMP_COMPANY
0   False     False    False        False
1   False     False    False        False
2   False     False     True        False
3   False     False    False        False
4   False     False     True         True

In [64]:
df.isnull().sum()

EMP_ID         0
EMP_NAME       0
EMP_SAL        2
EMP_COMPANY    1
dtype: int64

In [65]:
df.isnull().sum().sum()

np.int64(3)

In [66]:
df.shape

(5, 4)

In [67]:
print("Rows :",df.shape[0])

Rows : 5

In [68]:
print("Column :",df.shape[1])

Column : 4

In [69]:
print("Total Cell :",df.shape[0]*df.shape[1])

Total Cell : 20

In [70]:
print("Missing Values : ",df.isnull().sum().sum())

Missing Values :  3

In [72]:
print("Missing Value %age : ",df.isnull().sum().sum()/(df.shape[0]*df.shape[1])*100)

Missing Value %age :  15.0

In [73]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev      NaN         NaN

In [84]:
df.dropna()

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
3     104   Ravi Kumar  56000.0     Amazaon

In [85]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev      NaN         NaN

In [90]:
# We can not fill all values at once like this
df.fillna(value="Missing")

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  Missing      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev  Missing     Missing

In [91]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev      NaN         NaN

In [92]:
df["EMP_SAL"]

0    35300.0
1    25500.0
2        NaN
3    56000.0
4        NaN
Name: EMP_SAL, dtype: float64

In [95]:
df["EMP_SAL"] = df["EMP_SAL"].fillna(value=20000)

In [96]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  20000.0      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev  20000.0         NaN

In [97]:
df["EMP_COMPANY"]

0       Google
1    Microsoft
2       OpenAI
3      Amazaon
4          NaN
Name: EMP_COMPANY, dtype: object

In [99]:
df["EMP_COMPANY"]=df["EMP_COMPANY"].fillna(value="MISSING")

In [100]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  20000.0      OpenAI
3     104   Ravi Kumar  56000.0     Amazaon
4     105     Raju Dev  20000.0     MISSING

In [101]:
sum(df["EMP_SAL"])

156800.0

In [165]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev      NaN         NaN

In [166]:
sums = 0
count = 0
for sal in df["EMP_SAL"]:
    if(not np.isnan(sal)):
        sums = sums+sal
        count+=1

In [167]:
sums

116800.0

In [168]:
count

3

In [169]:
sums/count

38933.333333333336

In [170]:
df["EMP_SAL"] = df["EMP_SAL"].fillna(value=sums//count)

In [172]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  38933.0      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev  38933.0         NaN

In [174]:
df["EMP_COMPANY"].mode()[0]

'Google'

In [175]:
df["EMP_COMPANY"] = df["EMP_COMPANY"].fillna(value=df["EMP_COMPANY"].mode()[0])

In [176]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  38933.0      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev  38933.0      Google

In [179]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev      NaN         NaN

In [182]:
df.fillna(method="ffill")

C:\Users\saini\AppData\Local\Temp\ipykernel_14068\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  25500.0      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev  56000.0      Google

In [183]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh      NaN      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev      NaN         NaN

In [184]:
df.ffill()

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY
0     101  Rahul Kumar  35300.0      Google
1     102  Vijay Sagar  25500.0   Microsoft
2     103   Siya Singh  25500.0      OpenAI
3     104   Ravi Kumar  56000.0      Google
4     105     Raju Dev  56000.0      Google

In [187]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY EMP_COUNTRY
0     101  Rahul Kumar  35300.0      Google       INDIA
1     102  Vijay Sagar  25500.0   Microsoft       JAPAN
2     103   Siya Singh      NaN      OpenAI         USA
3     104   Ravi Kumar  56000.0      Google   AUSTRALIA
4     105     Raju Dev      NaN         NaN       SPAIN

In [191]:
df = df.ffill()

In [192]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY EMP_COUNTRY
0     101  Rahul Kumar  35300.0      Google       INDIA
1     102  Vijay Sagar  25500.0   Microsoft       JAPAN
2     103   Siya Singh  25500.0      OpenAI         USA
3     104   Ravi Kumar  56000.0      Google   AUSTRALIA
4     105     Raju Dev  56000.0      Google       SPAIN

In [197]:
def Country(value):
    return value[:3]

In [199]:
df["EMP_COUNTRY"] = df["EMP_COUNTRY"].map(Country)

In [200]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY EMP_COUNTRY
0     101  Rahul Kumar  35300.0      Google         IND
1     102  Vijay Sagar  25500.0   Microsoft         JAP
2     103   Siya Singh  25500.0      OpenAI         USA
3     104   Ravi Kumar  56000.0      Google         AUS
4     105     Raju Dev  56000.0      Google         SPA

In [201]:
def updateSalary(sal):
    return sal+2000

In [202]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY EMP_COUNTRY
0     101  Rahul Kumar  35300.0      Google         IND
1     102  Vijay Sagar  25500.0   Microsoft         JAP
2     103   Siya Singh  25500.0      OpenAI         USA
3     104   Ravi Kumar  56000.0      Google         AUS
4     105     Raju Dev  56000.0      Google         SPA

In [203]:
df["EMP_SAL"] = df["EMP_SAL"].map(updateSalary)

In [204]:
df

   EMP_ID     EMP_NAME  EMP_SAL EMP_COMPANY EMP_COUNTRY
0     101  Rahul Kumar  37300.0      Google         IND
1     102  Vijay Sagar  27500.0   Microsoft         JAP
2     103   Siya Singh  27500.0      OpenAI         USA
3     104   Ravi Kumar  58000.0      Google         AUS
4     105     Raju Dev  58000.0      Google         SPA